//0-b 筛法求素数

//将数从小到大排列，首先筛去1，在剩下的数中依次筛去最小素数的倍数，直至筛子为空
//可将非素数对应位的值设为零，则每次循环时首位非零数必为素数



#include<stdio.h>
int main(void)
{
    int n,i,j,s,a[1000],b[1000];   //求1到n之间的素数
    scanf("%d",&n);
    s=0;

    for(i=1;i<=n;i++){
       b[i]=0;
       a[i]=s+1;
       s=s+1;                     //将n个数从小到大排列
    }
    a[0]=0;
    a[1]=0;

    for(i=0;i<=n;i++){
        if(a[i]!=0){
            printf("%d ",a[i]);  //输出不为零的数
            for(j=1;j<=n/i;j++){
                a[i*j]=0;       //令最小素数的倍数位值为零
            }
        }
    }


    return 0;


}
