/*
输入数字n，按顺序打印出从1到最大的n位十进制数。比如输入3，则打印出1、2、3一直到最大的三位数999

示例:输入:n=1
     输出:[1,2,3,4,5,6,7,8,9]

说明:用返回一个整数列表来代替打印
     n为正整数
*/

//理解:1~9,2~99,3~999,4~9999·····n~(10^n)-1
//存在问题：(1)耗时太长 (2)当采用幂函数pow(10,n)确定最大值时，只对1,3,5,6有效，2,4输出最大分别为98、998

#include<stdio.h>
int main(void)
{
    int i,n,max;
    printf("n=");
    scanf("%d",&n);

    max=1;
    for(i=1;i<=n;i++){
        max=max*10;
    }
    printf("[%d",n);
    for(i=n+1;i<max;i++){
        printf(",%d",i);
    }
    printf("]\n");
    return 0;
}
