/*
给定一个非负整数数组A,A中一半整数是奇数,一半整数是偶数,对数组进行排序,以便当A[i]为奇数时,i也是奇数；
当A[i]为偶数时,i也是偶数,你可以返回任何满足上述条件的数组作为答案

示例：输入:[4,2,5,7]
      输出:[4,5,2,7]
解释:[4,7,2,5],[2,5,4,7],[2,7,4,5]也会被接受

提示：2<=A.length<=20000
      A.length%2==0
      0<=A[i]<=1000
*/

//[偶数，奇数，偶数，奇数...],[0,1,2,3...]

#include<stdio.h>
int main(void)
{
    int i,n,A[20000];
    char ch;
    n=0;
    printf("[");
    for(i=0;i<20000;i++){
        scanf("%d",&A[i]);
        n=n+1;
        ch=getchar();
        if(ch==']') break;
    }
    int B[n];
    int k=0,l=1;
    for(i=0;i<n;i++){
        if(A[i]%2==0){
            B[k]=A[i];                  /*将偶数存入B中下标为偶数的单元*/
            k=k+2;
        }
        if(A[i]%2!=0){
            B[l]=A[i];
            l=l+2;                      /*将奇数存入B中下标为奇数的单元*/
        }
    }
    printf("[%d",B[0]);
    for(i=1;i<n;i++){
        printf(",%d",B[i]);
    }
    printf("]\n");
    return 0;
}
